rickymetz/esp32-hackathon/launcher/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16MB flash, QIO
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ESP32-S3R8 has 8MB OCTAL PSRAM. OCT mode is NOT the IDF default --
# without it the PSRAM silently fails to initialise.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Room for LVGL + Lua
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# Voice module (Part G): English MultiNet 7 for offline command
# recognition, models flashed to the "model" partition. No wake word --
# capture is push-to-talk from the keyboard's mic key.
CONFIG_SR_MN_EN_MULTINET7_QUANT=y

# SHOT over serial re-renders the active screen with lv_snapshot so an
# agent can see the UI without a human photographing the panel.
CONFIG_LV_USE_SNAPSHOT=y

# lua_module_lvgl uses LVGL's Tiny TTF for runtime fonts
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y

# Card-loaded app icons (apps/<id>/icon.bin) are file-sourced RGB565 images.
# The launcher scales them to the tile (120 -> 128 in the grid), and the
# streaming bin decoder scales without antialiasing -- jagged edges plus a
# scaler artifact ("nub") at the bottom. RAM-load decodes each icon fully
# into a buffer first, so it scales as smoothly as the built-in in-RAM icons.
# Costs ~28.8 KB PSRAM per visible card icon while it's on screen.
CONFIG_LV_BIN_DECODER_RAM_LOAD=y

# Image cache. RAM_LOAD above makes every icon decode allocate a full-image
# buffer (128x128 RGB565 = 32,768 bytes) and read the whole file off the SD
# card. With the cache at LVGL's default of 0 that work is never reused:
# lv_bin_decoder returns before caching when the cache is disabled, so every
# redraw of a screen carrying card icons repeats the SD read AND the 32 KB
# alloc/free. Not a leak -- the close path frees correctly -- but churn, and it
# is worst exactly where card icons live, on the launcher home screen while
# scrolling. The two settings have to be enabled together; RAM_LOAD alone
# traded a scaling artifact for per-draw I/O.
#
# 256 KB is roughly eight icons' working set. It lands in PSRAM, not internal
# DRAM (CONFIG_SPIRAM_USE_MALLOC=y with SPIRAM_MALLOC_ALWAYSINTERNAL=0), which
# is the only reason a figure this size is affordable -- internal DRAM's
# largest contiguous block measures ~73 KB.
#
# Symbol verified against launcher/managed_components/lvgl__lvgl/Kconfig:759,
# not guessed -- the same check CONFIG_LV_USE_PERF_MONITOR needed.
# From docs/RAM_AUDIT.md finding 1 (PR #6).
CONFIG_LV_CACHE_DEF_SIZE=262144

# I4: raising the fixed pool (I3, 64->128 KB) stopped LVGL's rebuild-before-
# delete refresh from exhausting it, but that pool comes out of internal
# DRAM -- the scarcest resource on this board -- and the extra 64 KB broke
# the day-1 headroom budget for Phase 3 (BLE) and Phase 4 (Wi-Fi+HTTPS).
# Fix at the root instead of tuning the ceiling: give LVGL the standard C
# allocator (verified in launcher/managed_components/lvgl__lvgl/Kconfig,
# under "Memory Settings" -> "Malloc functions source" -- the choice member
# is CONFIG_LV_USE_CLIB_MALLOC, not a guessed LV_USE_STDLIB_MALLOC symbol)
# so lv_malloc() goes through the general heap instead of a fixed block.
# CONFIG_SPIRAM_USE_MALLOC is already on by default here, and with
# CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL forced to 0 below, malloc() prefers
# the 8 MB of PSRAM for everything instead of pinning small (<16 KB, the
# stock default) allocations to internal DRAM -- which is what LVGL's
# per-widget allocations are. This removes the fixed ceiling entirely
# rather than just raising it again, so this bug class cannot recur.
# MAX_VISIBLE_ROWS (launcher_main.c) and the fail-fast assert handler below
# stay regardless -- both are still good hygiene against unbounded growth.
CONFIG_LV_USE_CLIB_MALLOC=y
# CONFIG_LV_MEM_SIZE_KILOBYTES no longer applies: it `depends on
# LV_USE_BUILTIN_MALLOC` in the Kconfig above, so it is neutralized (not
# just unset) by the CLIB_MALLOC choice and is omitted here rather than
# left set-but-ignored.

# Without this, malloc() keeps every allocation under 16 KB (the stock
# SPIRAM_MALLOC_ALWAYSINTERNAL default) in internal DRAM regardless of
# CLIB_MALLOC above -- and LVGL's per-widget allocations are all well under
# that, so the fixed-pool bug would just reappear as unbounded internal-heap
# growth instead of a hard ceiling. Forcing this to 0 makes malloc() prefer
# PSRAM for everything; it still falls back to internal memory if PSRAM is
# exhausted, so DMA/internal-only requests (draw buffers, FreeRTOS stacks)
# are unaffected -- those go through heap_caps_malloc() with explicit caps,
# not plain malloc(), and are untouched by this option.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=0

# I3: CONFIG_LV_USE_ASSERT_MALLOC's default handler (LV_ASSERT_HANDLER) is
# `while(1);` -- an lv_malloc() failure spins the calling task forever
# instead of returning NULL, and CONFIG_ESP_TASK_WDT_PANIC then turns that
# into a 10s-late whole-board panic. This symbol only controls the header
# `#include`d before the handler body; the handler body itself
# (CONFIG_LV_ASSERT_HANDLER) has no backing Kconfig entry -- confirmed by
# building with it set and finding it dropped with "unknown kconfig symbol"
# and absent from sdkconfig.h. The actual handler override lives in
# CMakeLists.txt / lv_assert_override.h as a force-included header instead.
CONFIG_LV_ASSERT_HANDLER_INCLUDE="esp_system.h"

# The real default font is Lexend 32 (components/fonts_lexend), set as the
# THEME font in app_main() -- LVGL's LV_FONT_DEFAULT Kconfig choice only
# offers bundled faces, so it cannot name Lexend. Montserrat 14 stays
# compiled solely so the LV_FONT_DEFAULT macro resolves; nothing renders it.
# 32px is the converged Apple/Wear body size on this panel's 2x scale; see
# docs/DESIGN_GUIDE.md.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y

# App files on SD need real names, not 8.3. Without this, "weather_clock.lua"
# is invisible to the launcher.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Custom partition table: the default 1MB app partition cannot fit
# LVGL + Lua + the LVGL bindings.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Serial push needs an INPUT path. The USB-Serial/JTAG secondary console is
# output-only, so promote it to primary -- the board talks to the host over
# native USB, not UART0.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# A runaway app that the Lua hook cannot interrupt (a tight loop inside a C
# call, or inside a coroutine) must not wedge the board forever. Panic on
# watchdog so it reboots into a working launcher instead of warning every
# 5 seconds until someone power-cycles it.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Default is 1000000, so runaway recursion tries to allocate ~16 MB of Lua
# stack from PSRAM before raising "stack overflow" -- meaning the out-of-memory
# lands on some unrelated allocation first and the real cause is invisible.
CONFIG_LUA_MAXSTACK=65536

# ---- Performance instrumentation -------------------------------------
# Per-task CPU accounting for the STATS serial command (serial_push.c).
# Without these, uxTaskGetSystemState() reports no run-time counters and
# STATS says "cpu unavailable" rather than failing to build.
#
# Costs internal DRAM: TRACE_FACILITY widens every TCB, and internal DRAM
# is the scarcest resource on this board (measured 72 KB largest
# contiguous block at idle, 42 KB with an app running). Compare MEM
# before and after -- if the largest block moves materially, that is a
# real budget decision, not noise.
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
# vTaskList()/vTaskGetRunTimeStats() string helpers. STATS does not need
# them (it walks uxTaskGetSystemState directly), but they make a one-off
# dump from a debugger or a console hook possible without a rebuild.
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y

# LVGL's own frame-rate / CPU overlay. Symbol names verified against
# launcher/managed_components/lvgl__lvgl/Kconfig (LV_USE_SYSMON at line
# 1626, LV_USE_PERF_MONITOR at 1630) rather than guessed -- the same
# check that CONFIG_LV_USE_CLIB_MALLOC above needed.
#
# SYSMON stays on -- it is the subsystem, and costs nothing unattached.
#
# PERF_MONITOR is compiled IN but HIDDEN AT BOOT, and toggled at runtime:
# Settings -> Display & sound -> "FPS overlay", remembered in NVS as `fps`.
# lv_sysmon_show_performance() / lv_sysmon_hide_performance() do the work. So
# you get a frame rate on the board in front of you without a reflash, and a
# release still boots clean -- .github/workflows/release.yml builds release
# firmware straight from this file, and leaving the overlay on shipped a debug
# readout painted over the watch face to every board flashed from a release.
#
# The comment that used to sit here claimed "SHOT captures it automatically:
# every screenshot the harness takes carries the frame rate with it". That is
# FALSE, and has now been established twice independently: lv_sysmon builds its
# label on the SYSTEM LAYER (lv_label_create(lv_display_get_layer_sys(disp)),
# lvgl/src/debugging/sysmon/lv_sysmon.c), while handle_shot() snapshots
# lv_screen_active(). The system layer is a sibling of the screen, not a child,
# so the overlay can never appear in a SHOT. docs/PERF_DEBUG.md section 2 always
# documented this correctly; only this comment was wrong. One upside: it
# provably cannot contaminate a golden-frame diff.
#
# If you want a frame rate the HARNESS can read, LOG_MODE is the mechanism --
# but it is not a one-line switch, which is the trap. lv_sysmon emits it with
# bare LV_LOG(), which compiles to nothing unless LV_USE_LOG is on, and
# LV_USE_LOG is off in this build. Setting LOG_MODE alone therefore removes the
# overlay and prints NOTHING -- strictly worse than either state. The full
# change is four symbols, and turns LVGL's own logging on globally:
#     CONFIG_LV_USE_PERF_MONITOR_LOG_MODE=y
#     CONFIG_LV_USE_LOG=y
#     CONFIG_LV_LOG_LEVEL_WARN=y    # < LV_LOG_LEVEL_NONE, so bare LV_LOG emits;
#                                   # also surfaces LVGL's own WARN/ERROR
#     CONFIG_LV_LOG_PRINTF=y        # route it to the console
# Symbols verified against launcher/managed_components/lvgl__lvgl/Kconfig and
# src/misc/lv_log.h. NOT tried on hardware -- the console-volume impact of
# turning LVGL logging on is unmeasured, so measure before committing to it.
CONFIG_LV_USE_SYSMON=y
CONFIG_LV_USE_PERF_MONITOR=y
# Deliberately NOT enabling CONFIG_LV_USE_MEM_MONITOR: it reports
# lv_mem_monitor(), whose core is a no-op under CONFIG_LV_USE_CLIB_MALLOC
# (set above), so it would paint a permanent 0/0 on screen. STATS reports
# the real heap instead.
